[["MATH 1013", "Applied Calculus I", "Introduction to the theory and applications of both differential and integral calculus. Limits. Derivatives of algebraic and trigonometric functions. Riemann sums, definite integrals and the Fundamental Theorem of Calculus. Logarithms and exponentials, Extreme value problems, Related rates, Areas and Volumes. ", ["MATH 1520"]], ["MATH 1014", "Applied Calculus II", "Calculus in Polar Coordinates. Techniques of Integration. Indeterminate Forms. Improper Integrals. Sequences, infinite series and power series. Approximations. Introduction to ordinary differential equations. ", ["MATH 1013", "MATH 1300", "MATH 1901", "ISCI 1401", "MATH 1530", "MATH 1540", "MATH 1550", "ECON 1530", "ECON 1540"]], ["MATH 1019", "Discrete Mathematics for Computer Science", "Introduction to abstraction. Use and development of precise formulations of mathematical ideas. Informal introduction to logic; introduction to naïve set theory; induction; relations and functions; big O-notation; recursive definitions, recurrence relations and their solutions; graphs and trees. ", ["MATH 1190"]], ["MATH 1021", "Linear Algebra I", "Systems of linear equations, matrix algebra, determinants and diagonalization, vector geometry, and the vector space R^n. ", []], ["MATH 1025", "Applied Linear Algebra", "Topics include spherical and cylindrical coordinates in Euclidean 3-space, general matrix algebra, determinants, vector space concepts for Euclidean n-space (e.g. linear dependence and independence, basis, dimension, linear transformations etc.), an introduction to eigenvalues and eigenvectors. ", []], ["MATH 1028", "Discrete Mathematics for Engineers", "An introduction to propositional logic and application to switching circuits; sets, relations and functions; predicate logic and proof techniques; induction with applications to program correctness; basic counting techniques with applications; graphs and trees with applications in circuit analysis, information storage and retrieval, Huffman coding; automata and applications in software engineering. ", []], ["MATH 1090", "Introduction to Logic for Computer Science", "The syntax and semantics of propositional and predicate logic. Applications to program specification and verification. Optional topics include set theory and induction using the formal logical language of the first part of the course. ", ["MATH 1190", "MATH 1019"]], ["MATH 1131", "Introduction to Statistics I", "Displaying and describing distributions; relations in categorical data; Simpson's paradox and the need for design; experimental design and sampling design; randomization; probability laws and models; central limit theorem; statistical inference including confidence intervals and tests of significance; matched pairs; simulation. ", []], ["MATH 1190", "Introduction to Sets and Logic", "Topics include logic, sets, functions, relations, modular arithmetic and applications of elementary number theory, proof techniques, induction. ", ["MATH 1510", "MATH 1670", "MATH 1710"]], ["MATH 1200", "Problems, Conjectures and Proofs", "Extended exploration of elementary problems leading to conjectures, partial solutions, revisions, and convincing reasoning, and hence to proofs. Emphasis on problem solving, reasoning, and proving. Regular participation is required. ", []], ["MATH 1280", "Principles of Risk Management and Insurance", "This course deals with the notion of risk and the ways to manage it, by exploring the general framework of risk management for businesses, individuals and societies, and by focusing on the role of insurance as a risk transfer mechanism. More specifically, the course categorizes and studies those risks that are associated with financial markets (liquidity risk, pricing risk, credit risk, among other financial risks) as well as those risks that arise from operations of an enterprise, regulations, digital transformation, the impacts of the environment or a catastrophe (among other non-financial risks). Also, the course examines in detail the various aspects of the insurance mechanism as a route to manage some of the aforementioned risks. The course combines classical lectures with biweekly presentations by visiting risk professionals, thus immersing the students into theory and practice of modern risk management. ", []], ["MATH 1300", "Differential Calculus with Applications", "Limits, derivatives with applications, antiderivatives, fundamental theorem of calculus, beginnings of integral calculus. ", ["MATH 1520", "MATH 1710"]], ["MATH 1310", "Integral Calculus with Applications", "Transcendental functions, differential equations, techniques of integration, improper integrals, infinite series. ", ["MATH 1013", "MATH 1300", "MATH 1901, SC/ISCI 1401", "ISCI 1401", "MATH 1530", "MATH 1540", "MATH 1550", "ECON 1530", "ECON 1540"]], ["MATH 1506", "Mathematics I for the Biological and Health Sciences", "A presentation of functions, systems of linear equations, and an in-depth presentation of single variable differential calculus. Emphasis is placed on basic mathematical skills and their applications. ", ["MATH 1510"]], ["MATH 1507", "Mathematics II for the Biological and Health Sciences", "An introduction to single variable integral, probability and statistics. This course is designed to provide a comprehensive mathematical background for students of the biological and social sciences. Students continue to develop basic mathematical skills and applications from SC/MATH 1506. ", ["MATH 1506"]], ["MATH 1510", "Fundamentals of Mathematics", "Designed for the student whose mathematical background is weak and who wishes to take further courses in mathematics. Topics include algebraic equations and inequalities; simple sequences and series; analytic geometry; trigonometry; functions, including algebraic, exponential, logarithmic and trigonometric functions. ", ["MATH 1520"]], ["MATH 1520", "Introduction to Calculus, with Vectors", "Elements of vectors in 2- and 3-space including dot products, cross products, lines, and planes; elements of differential calculus including limits and derivatives. Designed for students who have not taken (or who have performed inadequately in) Ontario high school calculus. ", ["MATH 1670, 12U Advanced Functions (MHF4U) or equivalent, or permission of the departme", "ECON 1530", "ECON 1540", "MATH 1550"]], ["MATH 1532", "Statistics for Business and Society", "An introduction to statistics with an emphasis on concepts and applications relevant in the Business and Society program. Students learn basic and practical statistical techniques to explore and analyze data. Emphasis is placed on statistical reasoning and the critical interpretation of statistical information such as that seen in the media and journals. NCR note: SC/MATH 1532 3.00 may not be taken for credit by any student who has successfully completed or is concurrently enrolled in SC/MATH 1131 3.00, SC/MATH 2565 3.00, SC/MATH 2560 3.00, SC/ MATH 2570 3.00, SC/MATH 2930 3.00, SC/BIOL 2060 3.00 or equivalents. ", []], ["MATH 1581", "Business Mathematics I", "Introduction to interest rates (simple, compound), annuities (ordinary, due, deferred), amortization (mortgages, other debts), sinking funds, bonds (face value, bond rate, price, yield rate) and depreciation (straight line, constant percentage). ", []], ["MATH 2001", "Real Analysis l", "Axioms for, and properties of, the real numbers; sequences; functions of a real variable, continuity, differentiation, Riemann integration. Rigorous definitions of convergence and limit underpin a proof-based treatment of the subject material. Intended for Honours students in Mathematics. ", ["MATH 1200", "MATH 1310"]], ["MATH 2015", "Applied Multivariate and Vector Calculus", "Topics covered include partial derivatives; grad, div, curl and Laplacian operators; line and surface integrals; theorems of Gauss and Stokes; double and triple integrals in various coordinate systems; extrema and Taylor series for multivariate functions. ", ["MATH 1010", "MATH 1014", "MATH 1310", "MATH 1505"]], ["MATH 2022", "Linear Algebra II", "Vector spaces, linear transformations, change of basis, orthogonality, inner product spaces and canonical forms. ", ["MATH 1021", "MATH 2021", "MATH/MODR 2650", "MODR 2650"]], ["MATH 2030", "Elementary Probability", "Introduction to the theory of probability as preparation for further study in either mathematical or applied probability and statistics. Topics include probability spaces, conditional probability, independence, random variables, distribution functions, expectation, Chebyshev's inequality, common distributions, moment-generating functions and limit theorems. ", ["MATH 1014", "MATH 1310", "ISCI 1402", "ISCI 1410"]], ["MATH 2041", "Symbolic Computation Laboratory I", "An introduction to symbolic computing in the Maple environment. Topics from single-variable differential and integral calculus, including simple ordinary differential equations, are covered. Both mathematical understanding and applications are emphasized. Three lecture hours, open laboratory hours. One term. Three credits. ", ["EECS 1560", "MATH 1014", "MATH 1310", "ISCI 1401", "ISCI 1410", "CSE 1540", "MATH 1014", "MATH 1310"]], ["MATH 2131", "Introduction to Statistics II", "This course is a continuation of MATH 2030 3.00. It provides students with an introduction to statistical methods with an emphasis on applications using continuous probability models. ", ["MATH 1131", "MATH 2030", "MATH 2015", "MATH 2310"]], ["MATH 2200", "Extended Problems, Conjectures, and Proofs", "Extended exploration of problems leading to conjectures, partial solutions, and proofs. Problems build on reasoning which may be applied to fields such as analysis, algebra or number theory. Regular participation is required. ", ["MATH 1300", "MATH 1310", "ISCI 1401", "ISCI 1402", "ISCI 1410", "MATH 1021"]], ["MATH 2270", "Differential Equations", "Introduction to differential equations, including a discussion of the formation of mathematical models for real phenomena; solution by special techniques; applications; linear equations; solutions in series; other topics if time permits. ", ["MATH 2015", "MATH 2310", "MATH 1021", "MATH 1025", "MATH 2221"]], ["MATH 2271", "Differential Equations for Scientists and Engineers", "Introduction to ordinary and partial differential equations, including their classification, boundary conditions, and methods of solution. Equations, methods, and solutions relevant to science and engineering are emphasized, and exploration is encouraged with the aid of software. Three lecture hours per week. One term. Three credits. ", ["MATH 2015", "MATH 2310", "MATH 1025", "MATH 2022", "MATH 2222"]], ["MATH 2280", "The Mathematical Theory of Interest", "Topics include measurement of interest, annuities, amortization of loans, bonds, sinking funds and depreciation. The course is at a level which will prepare students for the interest theory portion of the Society of Actuaries examinations. ", ["MATH 1014", "MATH 1310", "ISCI 1401", "ISCI 1410"]], ["MATH 2281", "Models for Financial Economics", "A quantitative introduction to financial economics. The topics include arbitrage pricing theory, forwards and futures, American and European options, interest rate derivatives, yield curves, arbitrage hedging and pricing, put-call parity, arbitrage bounds, binomial model, Black-Scholes formula, risk-neutral valuation, trinomial model. The course ensures an adequate preparation for exam MFE of the Society of Actuaries. ", ["MATH 2030", "MATH 2280"]], ["MATH 2310", "Calculus of Several Variables with Applications", "Vector functions, partial derivatives, gradient, multiple integrals, line integrals, optimization, applications. ", ["MATH 1014", "MATH 1310", "ISCI 1402", "ISCI 1410"]], ["MATH 2565", "Introduction to Applied Statistics", "The aim of this course is to give students in various disciplines some fundamental tools in statistical inference. Students will understand when and how to use statistical tools such as the z, t or chi-squared tests, regression analysis, analysis of variance and various other techniques. Students will learn how to use the statistical software R for data analysis. ", [""]], ["MATH 2930", "Introductory Probability and Statistics", "This is an applied probability and statistics course for engineering students. The aim is to provide an application oriented introduction to probability and statistics. The examples will be from a wide selection of engineering disciplines. The probability component is about 30% of the lectures. About 40% of the time, the lectures and tutorials focus on solving practical statistical problems that emerge from engineering problems. ", ["MATH 1014", "MATH 1025", "EECS 1011"]], ["MATH 3001", "Real Analysis II", "Sequences and series of functions, uniform convergence, complex exponential. Cesaro convergence, convolution kernels, Weierstrass approximation. Inner product spaces, L2 convergence, pathologies of pointwise convergence. Applications: isoperimetric inequality, Weyl equidistribution, exotic functions. Fourier transform on the line. Continues MATH 2001. Proof-based. ", [" MATH 2001", "MATH 1310"]], ["MATH 3010", "Vector Integral Calculus", "Integrability of continuous functions over suitable domains, iterated integrals and Fubini's theorem, counterexamples, change of variables, Jacobian determinants, polar and spherical coordinates, volumes, vector fields, divergence, curl, line and surface integrals, Green's and Stokes's theorems, differential forms, general Stokes's theorem. ", ["MATH 2310", "MATH 2015", "MATH 2022", "MATH 2222"]], ["MATH 3021", "Algebra I", "Introduction to the basic concepts of abstract algebra, with applications: groups (cyclic, symmetric, Lagrange's theorem, quotients, homomorphism theorems). ", ["MATH 1019", "MATH 1190", "MATH 1200", "MATH 2022", "MATH 2222"]], ["MATH 3022", "Algebra II", "Continuation of SC/MATH 3021 3.00 with the introduction of rings (congruences, quotients, polynomials, integral domains, PIDs and UFDs) and fields (field extensions, constructions with ruler and compass, coding theory). ", ["MATH 3021"]], ["MATH 3052", "Exploring Geometries", "Exploration of various geometries, including basics of Euclidean and Spherical geometry, focusing on symmetry and transformations. A focus on geometric reasoning and multiple representations, including both synthetic and analytic approaches. Learning with hands-on materials, dynamic geometry software, group work, reflection, communication. ", ["MATH 2022", "MATH 2222"]], ["MATH 3090", "Computational Mathematics", "Modelling (discrete and continuous, deterministic and stochastic) and practical solutions to general categories of applied problems. Case studies of solutions through modelling and representation of data. Implementation, numerical considerations, efficiency, and application of numerical algorithms. ", ["MATH 2022", "MATH 2030", "CSE 1560", "CSE 2031", "MATH 2041", "CSE 1540", "MATH 2041", "MATH 2022", "MATH 2030", "CSE 1560", "CSE 2031", "MATH 2041", "CSE 1540", "MATH 2041"]], ["MATH 3131", "Mathematical Statistics I", "Topics include common density functions, probability functions, principle of likelihood, the likelihood function, the method of maximum likelihood, likelihood regions, tests of hypotheses, likelihood ratio tests, goodness of fit tests, conditional tests and confidence sets with a view towards applications. ", ["MATH 2131"]], ["MATH 3132", "Mathematical Statistics II", "Important examples and methods of statistical estimation and hypothesis testing are discussed in terms of their mathematical and statistical properties. Topics include sufficiency, Bayesian statistics, decision theory, most powerful tests, likelihood ratio tests. ", ["MATH 3131"]], ["MATH 3141", "Introduction to Number Theory", "Basic topics in number theory. Divisibility, primes and factorization, congruences, quadratic residues and the law of quadratic reciprocity, arithmetic functions and the Mobius inversion formula, Diophantine equations, primitive roots, continued fractions, partitions, the distribution of prime numbers, and applications to primality testing and cryptography. ", ["MATH 1200", "MATH 2200", "MATH 1021", "MATH 1025"]], ["MATH 3171", "Linear Optimization", "Introduces students to linear optimization (linear programming), including the problem formulation, simplex method, LP-duality theory, sensitivity analysis, and its business and industrial applications. ", ["MATH 1021", "MATH 1025", "MATH 2221"]], ["MATH 3172", "Combinatorial Optimization", "Introduces students to combinatorial optimization (integer programming), including problem formulation, branch-and-bound method, cutting-plane method, implicit enumeration, and its business and industrial applications, including transportation problem, network flow optimization etc. ", ["MATH 3171", "MATH 1021", "MATH 1025", "MATH 2221"]], ["MATH 3241", "Numerical Methods I", "An introductory course in computational linear algebra. Topics include simple error analysis, linear systems of equations, non-linear equations, linear least squares and interpolation. ", ["MATH 1010", "MATH 1014", "MATH 1310", "MATH 1021", "MATH 1025", "MATH 2221", "EECS 1540", "EECS 2031", "EECS 2501"]], ["MATH 3242", "Numerical Methods II", "Algorithms and computer methods for solving problems of differentiation, integration, systems of non-linear equations and matrix eigenvalues. ", ["MATH 3241", "EECS 3121"]], ["MATH 3250", "Mathematical Biology", "Introduces the student to mathematical modelling with applications in biology in related fields such as chemistry, ecology and health. There is an emphasis on case studies and problem solving skills. Topics include discrete and continuous models describing population dynamics, population health, chemical reactions and biological structures. ", ["MATH core and SC/CSE 1560", "CSE 1560", "EECS 1560"]], ["MATH 3260", "Introduction to Graph Theory", "Introductory graph theory with applications. Graphs, digraphs. Eulerian and Hamiltonian graphs. The travelling salesman. Path algorithms; connectivity; trees; planarity; colourings; scheduling; minimal cost networks. Tree searches and sorting, minimal connectors and applications from physical and biological sciences. ", ["MATH courses without second digit \""]], ["MATH 3271", "Partial Differential Equations", "Partial differential equations of mathematical physics and their solutions in various coordinates, separation of variables in Cartesian coordinates, application of boundary conditions; Fourier series and eigenfunction expansions; generalized curvilinear coordinates; separation of variables in spherical and polar coordinates. ", ["MATH 2270", "MATH 2010", "MATH 2015", "MATH 2310", "MATH 3010", "MATH 2010", "MATH 2310"]], ["MATH 3280", "Mathematics of Life Contingencies I", "Probabilistic introduction to the mathematics of life contingencies. The course develops a theoretical basis for modeling the future lifetime of certain financial objects with an emphasis on insurance. Topics include international actuarial notation, life tables, life statuses, (multivariate) survival distributions, dependence, multiple decrement theory. The course ensures an adequate preparation for the MLC exam of the Society of Actuaries. ", [" MATH 2131", "MATH 2280", "MATH 3280"]], ["MATH 3281", "Mathematics of Life Contingencies II", "Intermediate level course on the mathematics of life contingencies. The course builds on SC/MATH 3280 3.00 and develops theoretical basis for pricing and supporting life-contingent products. Topics include economics of insurance, general insurances and annuities, (benefit) premiums and reserves, analysis of reserves, Hattendorf's theorem. The course ensures an adequate preparation for the MLC exam of the Society of Actuaries. ", ["MATH 3280"]], ["MATH 3282", "Mathematical Finance", "A comprehensive introduction to continuous-time Mathematical Finance. This course introduces Brownian motion and Ito calculus and covers interest rate models and derivatives, the Black-Scholes model and the Black-Scholes partial differential equation, implied volatility and Merton's optimal portfolio problem. This course, together with MATH 2281 3.0 \"Models for Financial Economics\", prepares students for topics covered in the IFM and QFI Core exams of the Society of Actuaries. ", ["MATH 2131", "MATH 2281"]], ["MATH 3330", "Regression Analysis", "Simple regression analysis, multiple regression analysis, matrix form of the multiple regression model, estimation, tests (t- and F-tests), multicollinearity and other problems encountered in regression, diagnostics, model building and variable selection, remedies for violations of regression assumptions. ", ["MATH 1131", "MATH 2570", "PSYC 2020", "MATH 1021", "MATH 1025", "MATH 1505", "MATH 1550", "MATH 2221"]], ["MATH 3333", "Data analytics: A Hands-on Approach", "This is an applied statistics course for all math or science major students. The aim is to provide an application oriented training on data analytics in industrial or business setting. The course will cover a wide selection of data analytic techniques to equip students with appropriate computing skills and required statistical methodologies to conduct machine learning and data mining. The lectures will cover various methodologies and algorithms; as well as teach students to use data analytics related software (R or others) to solve real life problems. The students are expected to analyze data with the proposed software. ", ["MATH 1131 or equivalent; LE/EECS 1560 or LE/EESC 1541 or equivale", "EECS 1560 or LE/EESC 1541 or equivale", "EESC 1541 or equivale"]], ["MATH 3410", "Complex Variables", "Analytic functions, the Cauchy-Riemann equations, complex integrals, the Cauchy integral theorem, maximum modulus theorem. Calculations of residues and applications to definite integrals, two-dimensional potential problems and conformal mappings. ", ["MATH 2010", "MATH 2015", "MATH 2310", "MATH 3010", "MATH 2010"]], ["MATH 3430", "Sample Survey Design", "Principal steps in planning and conducting a sample survey. Sampling techniques including simple random sampling, stratified random sampling, cluster sampling and sampling with probabilities proportional to size. Estimation techniques including difference, ratio and regression estimation. ", ["MATH 2131", "MATH 3330"]], ["MATH 3901", "Mathematic and Statistics Internship Work Term", "Qualified Honours or Specialized Honours students gain relevant work experience as an integrated complement to their academic studies, reflected in the requirements of a learning agreement and work term report. Students are required to register in this course for each four month work term, with the maximum number of work term courses being four (16 months). Students in this course are assigned a Faculty Supervisor/Committee. During the course, students are expected to work at least 480 hours. ", ["MATH 3241", "MATH 3271", "MATH 3242", "MATH 3260", "MATH 3171", "MATH 3172", "MATH 3001", "MATH 3010", "MATH 3021", "MATH 3131", "MATH 3330", "MATH 3132", "MATH 3430", "MATH 2280", "MATH 2281", "MATH 2131", "MATH 3052", "fail cour"]], ["MATH 3902", "Mathematic and Statistics Internship Work Term", "Qualified Honours or Specialized Honours students gain relevant work experience as an integrated complement to their academic studies, reflected in the requirements of a learning agreement and work term report. Students are required to register in this course for each four month work term, with the maximum number of work term courses being four (16 months). Students in this course are assigned a Faculty Supervisor/Committee. During the course, students are expected to work at least 480 hours. ", ["MATH 3241", "MATH 3271", "MATH 3242", "MATH 3260", "MATH 3171", "MATH 3172", "MATH 3001", "MATH 3010", "MATH 3021", "MATH 3131", "MATH 3330", "MATH 3132", "MATH 3430", "MATH 2280", "MATH 2281", "MATH 2131", "MATH 3052", "fail cour"]], ["MATH 3903", "Mathematic and Statistics Internship Work Term", "Qualified Honours or Specialized Honours students gain relevant work experience as an integrated complement to their academic studies, reflected in the requirements of a learning agreement and work term report. Students are required to register in this course for each four month work term, with the maximum number of work term courses being four (16 months). Students in this course are assigned a Faculty Supervisor/Committee. During the course, students are expected to work at least 480 hours. ", ["MATH 3241", "MATH 3271", "MATH 3242", "MATH 3260", "MATH 3171", "MATH 3172", "MATH 3001", "MATH 3010", "MATH 3021", "MATH 3131", "MATH 3330", "MATH 3132", "MATH 3430", "MATH 2280", "MATH 2281", "MATH 2131", "MATH 3052", "fail cour"]], ["MATH 3904", "Mathematic and Statistics Internship Work Term", "Qualified Honours or Specialized Honours students gain relevant work experience as an integrated complement to their academic studies, reflected in the requirements of a learning agreement and work term report. Students are required to register in this course for each four month work term, with the maximum number of work term courses being four (16 months). Students in this course are assigned a Faculty Supervisor/Committee. During the course, students are expected to work at least 480 hours. ", ["MATH 3241", "MATH 3271", "MATH 3242", "MATH 3260", "MATH 3171", "MATH 3172", "MATH 3001", "MATH 3010", "MATH 3021", "MATH 3131", "MATH 3330", "MATH 3132", "MATH 3430", "MATH 2280", "MATH 2281", "MATH 2131", "MATH 3052", "fail cour"]], ["MATH 4000", "Individual Project", "A project of a pure or applied nature in mathematics or statistics under the supervision of a faculty member. The project allows the student to apply mathematical or statistical knowledge to problems of current interest. A report is required at the conclusion of the project. ", []], ["MATH 4000", "Individual Project", "A project of a pure or applied nature in mathematics or statistics under the supervision of a faculty member. The project allows the student to apply mathematical or statistical knowledge to problems of current interest. A report is required at the conclusion of the project. ", []], ["MATH 4011", "Metric Spaces", "Metric spaces, norms, metric topology, continuity, connectedness, completeness, Baire category, compactness of metric spaces, Stone-Weierstrass Theorem, Heine-Borel Theorem, Banach Contractive Mapping Theorem, Hilbert spaces. ", ["MATH 3001", "MATH 2022"]], ["MATH 4021", "Algebra III", "Continuation of SC/MATH 3020, with applications: groups (finitely generated abelian groups, solvable groups, simplicity of alternating groups, generators and relations, group actions, Sylow's theorems); field extensions, splitting fields, finite fields. ", ["MATH 3020", "MATH 3022"]], ["MATH 4060", "Time Series and Spectral Analysis", "Treatment of discrete sampled data involving correlation, convolution, spectral density estimation, frequency, domain filtering, and Fast Fourier Transforms. ", ["EECS 1011", "MATH 2015", "MATH 2271", "CSE 1540", "CSE 1540", "MATH 2015", "MATH 2271"]], ["MATH 4081", "Topology I", "An introduction to general topology: topological spaces, continuity, connectedness, compactness, topology of metric spaces, countability axioms, and separation axioms. ", ["MATH 3210", "MATH 3001"]], ["MATH 4090", "Mathematical Modelling", "Discrete, continuous and probabilistic modelling of problems from industry, finance and the life and physical sciences. The ability to model complex problems is stressed. ", ["MATH 3241", "MATH 3271", "MATH 3243"]], ["MATH 4100A", "Topics in Mathematics Education: Theory and Practice", "Provides opportunities for students to examine topics in mathematics, and themes in mathematics education. The main focus will be on developing students' ability to unpack and communicate concepts in mathematics, and to think critically about what mathematicians do and what students do when they are learning mathematics. ", ["MATH courses without second digit \"5\"; permission of the course coordinat"]], ["MATH 4120", "Gas and Fluid Dynamics", "Fundamental laws; conservation of mass, momentum and energy; vortex motion; incompressible, compressible and viscous flows; turbulent flow; surface waves. ", ["PHYS 2010", "ESSE 2470", "MATH 2271", "PHYS 2010", "EATS 2470", "MATH 2015", "MATH 2271"]], ["MATH 4130B", "Topics in Probability and Statistics: Introduction to the Theory and Methods of Time Series Analysis", "A systematic presentation of many statistical techniques for the analysis of time series data. The core topics include time dependence and randomness, trend, seasonality and error, stationary processes, ARMA and ARIMA processes, multivariate time series models and state-space models. ", ["MATH 3033", "MATH 3330", "MATH 3131"]], ["MATH 4141", "Advanced Numerical Methods", "Numerical methods for solving ordinary differential equations; optimization problems: steepest descents, conjugate gradient methods; approximation theory: least squares, orthogonal polynomials, Chebyshev and Fourier approximation, Padé approximation. ", ["MATH 2270", "CSE 3122", "MATH 3242", "MATH 2270", "MATH 3242", "CSE 3122"]], ["MATH 4143", "Scientific Computation for Finance Applications", "This course covers the basics numerical analysis/computational methods related to portfolio optimization, risk management and option pricing. It provides background material for computations in finance for two streams in the Computational Mathematics program and other interested students. ", ["MATH 2015", "MATH 2310", "MATH 1131", "MATH 2030", "CSE 1530", "CSE 1540", "MATH 2041", "MATH 2015", "MATH 2310", "MATH 1131", "MATH 2030", "CSE 1530", "CSE 1540", "MATH 2041"]], ["MATH 4160", "Combinatorial Mathematics", "Topics from algebra of sets, permutations, combinations, occupancy problems, partitions of integers, generating functions, combinatorial identities, recurrence relations, inclusion-exclusion principle, Polya's theory of counting, permanents, systems of distinct representatives, Latin rectangles, block designs, finite projective planes, Steiner triple systems. ", ["MATH 2022", "MATH 2222"]], ["MATH 4161", "Mathematics of Cryptography", "Probability, information theory and number theory and applications to cryptography. Classical codes such as Caesar shift, Vigenere, ADFGVX, rectangular substitution, and others. Other topics: comma free codes, perfect secrecy, index of coincidence, public key systems, primality testing and factorization algorithms. ", ["EECS 3101"]], ["MATH 4171", "Nonlinear Optimization", "This course introduces students to theories and modeling of nonlinear optimization (nonlinear programming). Three lecture hours per week. ", ["MATH 2015", "MATH 2310", "MATH 1021", "MATH 1025", "MATH 2221"]], ["MATH 4172", "Applied Operations Research Decision Models", "This course introduces the theory and applications of the following operations research decision models: Decision Tree Analysis, Game Theory, Inventory Models, and Dynamic Programming. Three lecture hours per week. ", ["MATH 2015", "MATH 2310", "MATH 2030"]], ["MATH 4271", "Dynamical Systems", "Iterations of maps and differential equations; phase portraits, flows; fixed points, periodic solutions and homoclinic orbits; stability, attraction, repulsion; Poincaré maps, transition to chaos. Applications: logistic maps, interacting populations, reaction kinetics, forced Van der Pol, damped Duffing and Lorenz equations. ", ["MATH 2270", "MATH 1021", "MATH 2221", "MATH 1025"]], ["MATH 4280", "Risk Theory - Loss Models and Risk Measures", "A comprehensive introduction to the single-period mathematical risk theory. The course explores approaches to modeling and measuring (insurance) risks. Topics include (univariate) distribution theory: exponential dispersion models, elliptical distributions, (a,b,k,) class, heavy-tailness; risk measurement: Value-at-Risk, Expected Shortfall, coherency; policy modifications: deductibles, (co)insurance, limits. The course ensures an adequate preparation for the C exam of the Society of Actuaries. ", ["MATH 2131"]], ["MATH 4281", "Risk Theory - Ruin and Credibility", "A comprehensive introduction to intermediate - level mathematical risk theory. The course on the one hand introduces a dynamic approach to risk measurement, and on the other develops the notion of prospective experience rating. Topics include probability of ruin, adjustment coefficient, Lunberg's inequality, credibility theory, simulation. The course ensures an adequate preparation for exam C of the Society of Actuaries. ", ["MATH 2131"]], ["MATH 4300", "Directed Readings", "A student may arrange to do independent study with a member of the Mathematics and Statistics Department. Such an arrangement must have prior approval of the department Chair.", []], ["MATH 4300", "Directed Readings", "A student may arrange to do independent study with a member of the Mathematics and Statistics Department. Such an arrangement must have prior approval of the department Chair.", []], ["MATH 4330", "Applied Categorical Data Analysis", "Categorical response data, two-way and three-way contingency tables, odds ratios, tests of independence, partial association. Generalized linear models. Logistic regression. Poisson regression. Count regression for Rate Data. Multicategory Logit Models. ", ["MATH 3131", "MATH 3330"]], ["MATH 4400", "The History of Mathematics", "Selected topics in the history of mathematics, discussed in full technical detail but with stress on the underlying ideas, their evolution and their context. ", ["MATH courses without second digit 5, including at least 12 credits at or above the 3000-lev"]], ["MATH 4431", "Probability Models", "Introduces the theory and applications of several kinds of probabilistic models, including renewal theory, branching processes and martingales. Additional topics may include stationary processes, large deviations or models from the sciences. ", ["MATH 2030"]], ["MATH 4630", "Applied Multivariate Statistical Analysis", "Covers the basic theory of the multivariate normal distribution and its application to multivariate inference about a single mean, comparison of several means and multivariate linear regression. As time and interest permit, further related topics may also be covered. ", ["MATH 3131", "MATH 3033", "MATH 3330", "MATH 2022", "MATH 2222"]], ["MATH 4650", "Feedback Control Systems", "This course teaches fundamentals of control design and analysis using state-space methods. This includes both the practical and theoretical aspects of the topic. The students are expected to design controllers using state-space methods and evaluate the control performance and validate if these controllers are robust to system uncertainties and external disturbances. ", ["ENG 4550", "MATH 3410", "MATH 2270", "MATH 2271", "MATH 2022"]], ["MATH 4730", "Experimental Design", "An examination of the statistical issues involved in ensuring that an experiment yields relevant information. Topics include randomized block, factorial, fractional factorial, nested, Latin square and related designs. Further topics as time permits. The emphasis is on applications. ", ["MATH 3033", "MATH 3330"]], ["MATH 4931", "Simulation and the Monte Carlo Methods", "Introduction to systems, models, simulation and Monte Carlo methods. Random number generation. Random variate generation. Monte Carlo integration and variance reduction techniques. Applications to queuing systems and networks. ", ["MATH 3330", "CSE 1560", "MATH 20"]], ["MATH 4939", "Statistical Data Analysis using SAS and R", "This course helps students to connect the statistical theory they have studied in their undergraduate program with reality through case-studies and data analysis representing in-depth investigations into the day-to-day practice of statistics. The course provides a hands-on approach with regular data-analysis laboratories and oral/written presentation of results by students. The course examines the role of hypothesis testing, estimation, power, regression, categorical data in practice using both SAS and R. ", ["MATH 3131", "MATH 3330", "MATH 4330"]]]