[["PHYS 1011", "Physics 1", "Topics include linear, rotational and oscillatory motion; Newtonian mechanics; work and energy; gravitation; waves and sound. Differential calculus and vector algebra are used. This course covers topics in greater depth than SC/PHYS 1411 3.00 or SC/PHYS 1421 3.00. It should be taken by all those likely to enroll in 2000-level physics courses, and is a prequel to SC/PHYS1012 3.0. ", ["PHYS 1510", "MATH 1505", "MATH 1520"]], ["PHYS 1012", "Physics 2", "A sequel to PHYS1011 3.0. Topics include electrostatics; magnetostatics; electric current, DC circuits, and induction; electromagnetic waves, optics. Differential and integral calculus and vector algebra are used. This course covers fewer topics than SC/PHYS 1411 3.00 or SC/PHYS 1421 3.00, but covers them in greater depth. It should be taken by all those likely to enrol in 2000-level physics courses. ", ["PHYS1011", "PHYS 1411", "PHYS 1421", "MATH1013", "MATH 1014", "MATH 1505"]], ["PHYS 1070", "Fundamentals of Astronomy", "An introduction to the foundations of astronomy and astrophysics. The course covers basic measurement concepts and techniques, and gives an overview of the properties and workings of planets and stars. ", ["PHYS 1510", "MATH 1013", "MATH 1505"]], ["PHYS 1411", "Physics Fundamentals 1", "A calculus-based survey of physics. Topics include kinematics, dynamics, momentum and energy for linear and rotational motion; elementary kinetic theory and thermodynamics. This course is recommended for students unlikely to take 2000-level Physics courses. It is a prequel to SC/PHYS 1412 3.0 ", ["PHYS 1510", "MATH 1505", "MATH 1520"]], ["PHYS 1412", "Physics Fundamentals 2", "A calculus-based survey of physics and sequel to SC/PHYS 1411 3.0. Topics include static and current electricity; waves and physical and geometrical optics; elements of modern physics. This course is recommended for students unlikely to take 2000-level Physics courses. ", ["PHYS 1411", "PHYS1421", "PHYS1011", "PHYS 1800"]], ["PHYS 1421", "Physics with Life Science Applications 1", "Fundamental physics concepts are emphasized through applications to the life sciences. Topics include linear and rotational motion; Newtonian mechanics; work and energy; fluid statics and dynamics. Differential calculus and vector algebra are used. This course is recommended for students unlikely to enroll in 2000-level physics courses, and is a prequel to SC/PHYS1422 3.00. ", ["PHYS 1510", "MATH 1505", "MATH 1520"]], ["PHYS 1422", "Physics with Life Science Applications 2", "A sequel to SC/PHYS1421 3.0 in which fundamental concepts are emphasized through applications to the life sciences. Topics include electrostatics; DC circuits; magnetic fields; induction; oscillation and waves, electromagnetic waves; optics. Differential calculus and vector algebra are used. This course is recommended for students unlikely to enrol in 2000-level physics courses. ", ["PHYS 1421", "PHYS1411", "PHYS1011", "PHYS 1800"]], ["PHYS 1470", "Highlights of Astronomy", "An introductory course on modern astronomy for science students surveys the nature, formation, and evolution of planets, stars, galaxies, and the universe by highlighting selected topics of wide interest and importance. ", ["MATH 1013", "MATH 1505"]], ["PHYS 1510", "Introduction to Physics", "An introductory course for students lacking adequate preparation for SC/PHYS 1010 6.00, SC/PHYS 1410 6.00, or SC/PHYS 1420 6.00. Topics include dynamics (forces and motion, including oscillatory motion), energy and momentum, gravitational, electric and magnetic fields, the wave nature of light, and geometric optics. No calculus is used, but vectors are used extensively.", []], ["PHYS 1800", "Engineering Mechanics", "Survey of the fundamental concepts of statics and dynamics with an emphasis on engineering applications. This is a calculus-based course intended primarily for engineering students. ", ["PHYS 1510", "MATH 1013", "MATH 1300", "MATH 1505"]], ["PHYS 1801", "Electricity, Magnetism and Optics for Engineers", "A survey of physics in which fundamental concepts in electricity, magnetism and optics are emphasized through engineering applications. This is a calculus-based course intended primarily for engineering students. ", ["PHYS 1800", "MATH 1013", "MATH 1014", "MATH 1310", "MATH 1505"]], ["PHYS 2010", "Classical Mechanics", "Newtonian mechanics of mass points and rigid bodies. Accelerated reference frames and rotational motion, centrifugal and Coriolis forces. Central force motion in celestial mechanics. Euler's equations: precession and nutation in the gyroscope. ", ["PHYS 1010", "PHYS 1800", "PHYS 1801", "ISCI 1310", "PHYS 1410", "PHYS 1420", "MATH 1014", "MATH 1025", "MATH 2015", "MATH 2271", "PHYS 1010", "PHYS 1410", "PHYS 1420", "MATH 1014", "MATH 1025", "MATH 2015"]], ["PHYS 2020", "Electricity and Magnetism", "The elements of electric and magnetic fields are developed together with DC and AC circuit theory. ", ["PHYS 1010", "PHYS 1800", "PHYS 1801", "ISCI 1310", "PHYS 1410", "PHYS 1420", "MATH 2015"]], ["PHYS 2030", "Computational Methods for Physicists and Engineers", "The symbolic and numeric computing environments provided by Maple and MATLAB are used to solve problems in mechanics and electromagnetism. ", ["PHYS 1010", "PHYS 1800", "PHYS 1801", "ISCI 1310", "PHYS 1410", "PHYS 1420", "EECS 1011", "EECS 1541", "MATH 1014", "MATH 2015", "MATH 2271"]], ["PHYS 2040", "Relativity and Modern Physics", "An introduction to the theories of relativity and quantum mechanics. Relativistic concepts of space, time and energy are presented. The quantum nature of radiation and matter is introduced. ", ["PHYS 1010", "PHYS 1800", "PHYS 1801", "ISCI 1310", "PHYS 1410", "PHYS 1420"]], ["PHYS 2060", "Optics and Spectra", "An introductory course in optics covering the following topics: wave nature of light, reflection, refraction, spherical mirrors and lenses, interference, diffraction, polarization, introduction to lasers. ", ["PHYS 1010", "PHYS 1800", "PHYS 1801", "ISCI 1310", "PHYS 1410", "PHYS 1420", "MATH 1014", "MATH 1025"]], ["PHYS 2070", "Galaxies and the Universe", "An introduction to the structure, evolution and origin of galaxies, aggregates of galaxies and the universe as a whole. Relevant details of stellar evolution are encompassed. Topics such as supernovae, pulsars, black holes, quasars, density waves, the cosmic web, cosmic expansion and dark constituents of the universe are included. ", ["PHYS 1510", "PHYS 1070", "PHYS 1470"]], ["PHYS 2211", "Experimental Electromagnetism", "An introductory laboratory course for second-year students. The course consists of 10 experiments covering basic concepts of electromagnetism. Normally three laboratory hours per week. One term. One credit. ", ["PHYS 1010", "PHYS 1800", "PHYS 1801", "ISCI 1310", "PHYS 1410", "PHYS 1420", "PHYS 2020"]], ["PHYS 2213", "Experimental Physics with Data Analysis", "Experiments in Electricity and Magnetism and in Modern Optics. Basic methods for analyzing experimental data and understanding statistical and systematic errors. ", ["PHYS 1010", "PHYS 1800", "PHYS 1801", "ISCI 1310", "PHYS 1410", "PHYS 1420", "PHYS 2020", "PHYS 2060"]], ["PHYS 3010", "Classical Mechanics", "Intermediate classical mechanics, including dynamics of particles and systems of particles. Lagrange's equations and Hamilton's equations. ", ["PHYS 2010", "MATH 2015", "MATH 2271"]], ["PHYS 3020", "Electromagnetics I", "Electrostatic and magnetostatic fields, derived from charge and current distributions studied in vacuum and in material media. ", ["PHYS 2020", "MATH 2015", "MATH 2271"]], ["PHYS 3030", "Statistical and Thermal Physics", "Statistical mechanics of systems of large numbers of elements. Probability, ensembles, fluctuations. Applications: spin magnetism, electrons in metals, radiation, specific heats of solids. Transport theory. ", ["PHYS 2020", "MATH 2015", "MATH 2271"]], ["PHYS 3040", "Modern Physics", "Survey of the basis of contemporary physics: introduction to elementary wave mechanics, and the quantum theory of atoms, molecules, solids, nuclei, elementary wave mechanics and elementary particles. ", ["PHYS 2010", "PHYS 2020", "PHYS 2060", "MATH 1025", "MATH 2015", "MATH 2271", "PHYS 3090"]], ["PHYS 3050", "Electronics I", "Introduction to physical electronics including DC and AC circuit theory and network analysis; bandpass filter; introduction to the p-n junction and semiconductor devices: diodes, DC power supplies, transistors, analysis and design of basic amplifiers, operational amplifiers. With laboratory exercises. ", ["PHYS 1010", "PHYS 1800", "PHYS 1801", "ISCI 1310", "PHYS 1410", "PHYS 1420", "PHYS 2020"]], ["PHYS 3070", "Planets and Planetary Systems", "Survey of planetary astrophysics. Topics include: the formation and evolution of planetary systems; the search for and discovery of extra-solar planets; current knowledge of the atmospheres, interiors and surfaces of planets, satellites and minor bodies within the Solar System. ", ["PHYS 1010", "PHYS 1800", "PHYS 1801", "ISCI 1310", "PHYS 1410", "PHYS 1420"]], ["PHYS 3080", "Atmospheric Radiation and Thermodynamics", "Applications of basic thermodynamic principles to dry and moist atmospheric situations. Solar (short wave) and terrestrial (long wave) radiation with respect to absorption and scattering processes involving atmospheric atoms, molecules, aerosol particles and clouds. ", ["MATH 2015", "MATH 2271", "PHYS 1010", "PHYS 1410", "PHYS 1420"]], ["PHYS 3090", "Methods in Theoretical Physics", "Methods of classical and modern theoretical physics are introduced to solve problems such as heat diffusion, wave propagation, modes of vibrating strings and membranes, electromagnetic potentials from charge distributions, Schrödinger waves and eigenvalues, and the angular distribution of cosmic radiation. ", ["PHYS 2020", "PHYS 3040"]], ["PHYS 3150", "Electronics II", "The concept of feedback and its use in circuits employing operational amplifiers; analysis/design of such circuits, including amplifiers, filters, oscillators, pulse generators; digital concepts and logic circuits with applications to data manipulation (computers) and storage. ", ["PHYS 3050"]], ["PHYS 3220", "Experiments in Modern Physics", "A selection of experiments in fluid mechanics, electromagnetism, optics, and atomic, nuclear, and particle physics. Analysis of the data and detailed write-ups are required. ", ["PHYS 2020", "PHYS 2060", "PHYS 2213", "PHYS 3040"]], ["PHYS 3250", "Introduction to Space Communications", "The course covers all aspects of communications between spacecraft and ground stations. Topics include orbital aspects of satellite communications, communications components of satellites and interplanetary spacecraft and ground stations, transmission, reception, link equations, modulation, multiplexing techniques and access to a satellite. ", ["PHYS 2020"]], ["PHYS 3280", "Physics of the Space Environment", "An introduction to the physical processes of the upper atmosphere, the ionosphere, the magnetosphere and the heliosphere, and the interactions that occur with space vehicles that traverse these regions of space. ", ["PHYS 2020", "MATH 2271"]], ["PHYS 3330", "Materials for Space Applications", "This course covers the behavior of materials relevant to the engineering of spacecraft. Material responses to thermal, mechanical, vacuum, electrical and ionizing radiation stresses are discussed. Engineering analysis tools and environment models are also covered. ", ["CHEM 1100", "PHYS 2020"]], ["PHYS 3900", "Physics Internship Work Term", "This experiential education course reflects the work term component of the Technology Internship Program (TIP). Qualified Honours students gain relevant work experience as an integrated complement to their academic studies, reflected in the requirements of a learning agreement and work term report. Students are required to register in this course for each four month work term, with the maximum number of work term courses being four ( i.e. 16 months). Students in this course receive assistance from the Career Centre prior to and during their internship, and are also assigned a Faculty Supervisor/Committee. ", ["PHYS courses overall; (2) that students are enrolled full-time in the Honours program prior to beginning their internship and have attended the mandatory preparatory sessions as outlined by the Career Centre; (3) that students have not been absent for more than two consecutive years as a full-time student from their Honours degree studies; (4) that upon enrolling in this course students have a minimum of nine credits remaining towards their Honours degree and need to return as a full-time student for at least one academic term to complete their degree after completion of their final work te", "PHYS 3900"]], ["PHYS 4010", "Quantum Mechanics", "Physical concepts and mathematical foundations of quantum mechanics. Emphasis on approximation methods, treatment of angular momentum, spin and their couplings. Introduction to relativistic quantum mechanics and scattering theory. ", ["PHYS 3040", "PHYS 3020"]], ["PHYS 4011", "Atomic and Molecular Physics", "Application of quantum mechanics to atomic and molecular structure. One-electron systems, many electron atoms, Hartree-Fock approximation, fine structure, hyperfine structure, atom-laser interactions. ", ["PHYS 4010"]], ["PHYS 4020", "Electromagnetics II", "Time-dependent electric and magnetic fields, Maxwell's differential equations in linear, isotropic, homogeneous conductors and dielectrics; the radiation and transmission of electromagnetic energy; relativistic transformation; scalar diffraction theory. ", ["PHYS 3020", "PHYS 2040"]], ["PHYS 4030", "Advanced Computational Methods for Scientists and Engineers", "Computational approaches are developed to introduce, demonstrate, and reinforce advanced core conceptual topics in physics. Topics include advanced data analysis and computational modeling techniques (e.g., signal processing, Monte Carlo simulations, numerical integration of ordinary and partial differential equations, etc.) as well as visualization strategies. Basic tenets and elements of \"Data Science\" and machine learning (e.g., Deep Learning) are introduced so that students gain exposure to, and an appreciation of, how large-scale computation is rapidly evolving and affecting a broad range of scientific methodologies. Pre-Requisites: PHYS 2030 3.0 or equivalent. MATH 2271 3.0 or equivalent. 6 credits from PHYS/BPHS 3*** (PHYS 3090 in particular is encouraged).", []], ["PHYS 4040", "Elementary Particle Physics", "The properties of the fundamental particles (quarks and leptons), and the forces between them are studied. Topics include the interactions of particles with matter, symmetry principles and experimental techniques. ", ["PHYS 2040", "PHYS 4010"]], ["PHYS 4050", "Solid State Physics", "The structural, mechanical, thermal, electrical and magnetic properties of crystalline solids are studied. ", ["PHYS 3030", "PHYS 4010"]], ["PHYS 4060", "Time Series and Spectral Analysis", "Treatment of discrete sampled data involving correlation, convolution, spectral density estimation, frequency, domain filtering, and Fast Fourier Transforms. ", ["EECS 1011", "MATH 2015", "MATH 2271", "CSE 1540", "CSE 1540", "MATH 2015", "MATH 2271"]], ["PHYS 4061", "Experimental Techniques in Laser Physics", "Involves a selection of experiments in laser physics, with emphasis on techniques necessary for trapping neutral atoms with lasers. Integrated with: GS/PHYS 5061 3.00. ", ["PHYS 2211", "PHYS 2212", "PHYS 2213", "PHYS 2020", "PHYS 2060", "PHYS 3040"]], ["PHYS 4062", "Atom Trapping", "Involves trapping atoms with lasers and investigating the properties of laser-cooled atoms. The course includes a set of lectures that cover theoretical concepts including basic properties of two-level atoms, radiation pressure, the laser cooling force, magnetic trapping, and the dipole force. One lecture hour and one tutorial hour per week and sixteen three hour laboratory sessions over a period of eight weeks. Integrated with: GS/PHYS 5062 3.00. ", ["PHYS 4061"]], ["PHYS 4070", "Stars and Nebulae", "The astrophysics of radiating matter in the universe. The course covers radiation processes, radiative transfer, interstellar matter, stellar atmospheres and stellar interiors. Normally offered in alternate years. ", ["PHYS 1070", "PHYS 3030", "PHYS 3040", "PHYS 3040"]], ["PHYS 4110", "Dynamics of Space Vehicles", "This course presents a coherent and unified framework for mathematical modeling and analysis of space vehicles. The course can be divided into two main parts: orbit dynamics and attitude dynamics and control. The topics covered by this course include two-body problem, coordinate transformation, orbital elements, perturbation theory, orbital maneuvers, relative motion and rendezvous, interplanetary trajectories, rocket dynamics, and attitude dynamics and control. Spacecraft dynamics and control problems of practical interests are treated from a dynamical systems point of view. This course will focus on a comprehensive treatment of spacecraft dynamics and control problems and their practical solutions. ", ["PHYS 2010", "ESSE 2470", "MATH 2271"]], ["PHYS 4120", "Gas and Fluid Dynamics", "Fundamental laws; conservation of mass, momentum and energy; vortex motion; incompressible, compressible and viscous flows; turbulent flow; surface waves. ", ["PHYS 2010", "ESSE 2470", "MATH 2271", "PHYS 2010", "EATS 2470", "MATH 2015", "MATH 2271"]], ["PHYS 4170", "Observational and Theoretical Cosmology", "A survey of observational and theoretical foundations of modern cosmology. Observational constraints on the history and current state of the universe are examined. Theoretical foundations of modern cosmology are introduced and employed to interpret observations. In the process, ideas about the early evolution of the universe, including the introduction of cosmic inflation and the development of large-scale structure, are elucidated. ", ["PHYS 3090"]], ["PHYS 4210", "Advanced Experimental Physics I", "Selected advanced experiments in physics related to topics in solid state physics, atomic spectroscopy, microwaves, low-noise measurements, superconductivity, and nuclear and particle physics. Open laboratory hours. ", ["PHYS 3220", "PHYS 3040"]], ["PHYS 4211", "Advanced Experimental Physics II", "Selected advanced experiments in physics related to topics in solid state physics, atomic spectroscopy, microwaves, low-noise measurements, superconductivity, and nuclear and particle physics. Open laboratory hours. ", ["PHYS 3220; registration in a Bachelor or Honours Program in physics and astronomy or in biophysi", "PHYS 3040"]], ["PHYS 4310", "Physics or Astronomy Project", "A faculty-supervised research endeavour, either experimental or theoretical, in physics or astronomy. Before enrolling, the student and faculty member must agree upon the project scope, background reading, milestones including student-faculty meeting schedule, and deliverables including final written report.", []], ["PHYS 4330", "Radio Science and Techniques for Space Exploration", "The theory and application of modern radio science and radio techniques in space exploration and space navigation. Topics include signal processing, radio astronomy fundamentals, Deep Space Network instrumentation, antenna theory, arrays, Very Long Baseline Interferometry, spacecraft navigation, radar systems, range, range rate and the radar equation. ", ["PHYS 3250"]], ["PHYS 4350", "Space Hardware", "Explores the theoretical, practical and experimental techniques needed to acquire and manipulate typical signals used in spacecraft system operations or integration and testing. Three laboratory hours and two lecture hours per week. ", ["PHYS 3150", "PHYS 3250"]]]